src/Documents/ПриемНаРаботуСписком/ПриемНаРаботуСписком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботуСписком</name>
  <registerRecords>InformationRegister.КадровыеПеремещения</registerRecords>
  <attributes>
    <name>ВыводитьПодразделениеВПечатныхФормах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/КадровыеПеремещения/КадровыеПеремещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадровыеПеремещения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричинаИзмененияСостояния</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПричинаИзмененияСостояния/ПричинаИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричинаИзмененияСостояния</name>
  <enumValues>
    <name>ПриемНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПриемНаРаботуСписком/ObjectModule.bsl
Функция СотрудникПринятНаРаботу(Сотрудник)
	
	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	КадровыеПеремещения.Период
//	|ИЗ
//	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
//	|ГДЕ
//	|	КадровыеПеремещения.Сотрудник = &Сотрудник
//	|	И
//	|		КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";
	
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Истина;
		
//	КонецЕсли;
	
//	Возврат Ложь;


/////Запрос = Новый Запрос;
/////Запрос.Текст =
/////	"ВЫБРАТЬ
/////	|	КадровыеПеремещения.Период
/////	|ИЗ
/////	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
/////	|ГДЕ
/////	|	КадровыеПеремещения.Сотрудник = &Сотрудник
/////	|	И КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";

/////Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

/////РезультатЗапроса = Запрос.Выполнить();

/////Выборка = РезультатЗапроса.Выбрать();

/////Если Выборка.Следующий() Тогда
	/////Возврат Истина;

/////КонецЕсли;
/////Возврат Ложь;


	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.КадровыеПеремещения.Записывать = Истина;
	Движения.КадровыеПеремещения.Очистить();
	
	
	///
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадровыеПеремещения.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
	|ГДЕ
	|	КадровыеПеремещения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричинаИзмененияСостояния.ПриемНаРаботу)";

////Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

    РезультатЗапроса = Запрос.Выполнить();
    
    ТабЗнач = РезультатЗапроса.Выгрузить();
    
    ТабЗнач.Индексы.Добавить("Сотрудник"); 
    
    

//Выборка = РезультатЗапроса.Выбрать();

//Если Выборка.Следующий() Тогда
//	Возврат Истина;

//КонецЕсли;
//Возврат Ложь;
	
	
	
	////
	Для Каждого Строка Из Работники Цикл
        МойРезультат = ТабЗнач.Найти(Строка.Сотрудник);
        
        Если МойРезультат <> Неопределено Тогда		
		
//		Если СотрудникПринятНаРаботу(Строка.Сотрудник) Тогда
			Сообщить ("Документ не проведен! Сотрудник уже принят " + Строка.Сотрудник.Наименование);
        	Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
	//проверка
	// регистр КадровыеПеремещения
	
		Движение = Движения.КадровыеПеремещения.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Должность = Строка.Должность;
		Движение.Подразделение = Строка.Подразделение;
      	Движение.Оклад = Строка.Оклад;
 		Движение.ПричинаИзмененияСостояния = Перечисления.ПричинаИзмененияСостояния.ПриемНаРаботу;
   	КонецЦикла;	

КонецПроцедуры
